##################################### GENERATOR #########################################

----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1             [-1, 16, 8192]             528
             PReLU-2             [-1, 16, 8192]               1
            Conv1d-3             [-1, 32, 4096]          16,416
             PReLU-4             [-1, 32, 4096]               1
            Conv1d-5             [-1, 32, 2048]          32,800
             PReLU-6             [-1, 32, 2048]               1
            Conv1d-7             [-1, 64, 1024]          65,600
             PReLU-8             [-1, 64, 1024]               1
            Conv1d-9              [-1, 64, 512]         131,136
            PReLU-10              [-1, 64, 512]               1
           Conv1d-11             [-1, 128, 256]         262,272
            PReLU-12             [-1, 128, 256]               1
           Conv1d-13             [-1, 128, 128]         524,416
            PReLU-14             [-1, 128, 128]               1
           Conv1d-15              [-1, 256, 64]       1,048,832
            PReLU-16              [-1, 256, 64]               1
           Conv1d-17              [-1, 256, 32]       2,097,408
            PReLU-18              [-1, 256, 32]               1
           Conv1d-19              [-1, 512, 16]       4,194,816
            PReLU-20              [-1, 512, 16]               1
           Conv1d-21              [-1, 1024, 8]      16,778,240
            PReLU-22              [-1, 1024, 8]               1
  ConvTranspose1d-23              [-1, 512, 16]      33,554,944
            PReLU-24             [-1, 1024, 16]               1
  ConvTranspose1d-25              [-1, 256, 32]       8,388,864
            PReLU-26              [-1, 512, 32]               1
  ConvTranspose1d-27              [-1, 256, 64]       4,194,560
            PReLU-28              [-1, 512, 64]               1
  ConvTranspose1d-29             [-1, 128, 128]       2,097,280
            PReLU-30             [-1, 256, 128]               1
  ConvTranspose1d-31             [-1, 128, 256]       1,048,704
            PReLU-32             [-1, 256, 256]               1
  ConvTranspose1d-33              [-1, 64, 512]         524,352
            PReLU-34             [-1, 128, 512]               1
  ConvTranspose1d-35             [-1, 64, 1024]         262,208
            PReLU-36            [-1, 128, 1024]               1
  ConvTranspose1d-37             [-1, 32, 2048]         131,104
            PReLU-38             [-1, 64, 2048]               1
  ConvTranspose1d-39             [-1, 32, 4096]          65,568
            PReLU-40             [-1, 64, 4096]               1
  ConvTranspose1d-41             [-1, 16, 8192]          32,784
            PReLU-42             [-1, 32, 8192]               1
  ConvTranspose1d-43             [-1, 1, 16384]           1,025
             Tanh-44             [-1, 1, 16384]               0
================================================================
Total params: 75,453,878
Trainable params: 75,453,878
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 512.00
Forward/backward pass size (MB): 19.75
Params size (MB): 287.83
Estimated Total Size (MB): 819.58
----------------------------------------------------------------